{
    "experience": [
        {
            "job_title": "Google Cloud Engineer Trainee",
            "company_name": "Generation UK",
            "location": "London, Uk",
            "start_date": "2023-12-01",
            "end_date": "2024-03-12",
            "job_description": "Improved comprehension and utilisation of a broad range of Google Cloud services quickly, resulting in the Google Cloud Digital Leader certification, obtaining the Google Associate Cloud Engineer certification quickly with ongoing post-course education.\nWorked with a group of colleagues to develop a Google Cloud Architecture solution in less than a week, which was subsequently presented to a packed Google Cloud London Headquarters.\nImproved competence with Linux and Python by means of committed study and practical experience gained from finishing a wide variety of labs.\nAccumulated a solid base of IT knowledge and expertise in the areas of programming, networking, cyber security, and devops.\nDeveloped vital skills through a demanding 12-week full-time program, including a growth mindset, proactivity, problem-solving, and perseverance.\n"
        },
        {
            "job_title": "Photographer - Retoucher",
            "company_name": "Freelancer",
            "location": "London, UK",
            "start_date": "2010-10-01",
            "end_date": "2022-10-01",
            "job_description": "Collaborated with renowned international publications to capture captivating visuals, adhering to editorial guidelines and project requirements.\nDeveloped project management and organisation skills by managing all aspects of photo shoots, including concept development, set design, lighting, and post-processing, ensuring exceptional deliverables.\nCaptured, processed, and created final print images or digital files, with strong attention to detail and creativity.\nPublications: Photo-Vogue, ICONIC, L’OFFICIEL, ASSURE, COY-CULTURE, French-fries-Magazine, SCHON-Magazine, Elle-Indonesia.\n"
        },
        {
            "job_title": "Manager-Photographer",
            "company_name": "SNAPPY SNAPS FRANCHISES LTD",
            "location": "London, UK",
            "start_date": "2015-08-01",
            "end_date": "2022-03-01",
            "job_description": "Consistently exceeded sales targets, achieving a 5-10% increase in revenue yearly.\nManaged a team delivering high-quality printing and framing services, ensuring customer satisfaction and adherence to deadlines.\nImplemented data-driven strategies to optimise store performance, using analytics in decision-making.\nProficient in data analysis and visualisation tools (e.g., Access, Excel).\nTechnical aptitude in working with printing and imaging technologies\n"
        },
        {
            "job_title": "Jr Machine Learning Developer",
            "company_name": "Freelancer",
            "location": "London,  UK",
            "start_date": "2022-03-01",
            "end_date": "Present",
            "job_description": "Developed deep learning algorithms using supervised and unsupervised learning techniques, such as neural networks and convolutional neural networks\nGained hands-on experience with computer vision libraries and frameworks, including TensorFlow, PyTorch, OpenCV\n"
        }
    ],
    "education": [
        {
            "degree": "Engineering in Applied Electronics and Telecommunication",
            "institution": "University \"Stefan cel Mare\"",
            "location": "Suceava, Romania",
            "start_date": "2007-10-01",
            "end_date": "2011-06-01",
            "description": ""
        }
    ],
    "skills": [
        {
            "skill": "TensorFlow",
            "level": "Advanced"
        },
        {
            "skill": "OpenCV",
            "level": "Intermediate"
        },
        {
            "skill": "Machine Learning",
            "level": "Advanced"
        },
        {
            "skill": "Google Cloud",
            "level": "Intermediate"
        },
        {
            "skill": "Python",
            "level": "Advanced"
        },
        {
            "skill": "Linux",
            "level": "Intermediate"
        },
        {
            "skill": "Numpy",
            "level": "Intermediate"
        },
        {
            "skill": "Docker",
            "level": "Intermediate"
        },
        {
            "skill": "MySQL",
            "level": "Beginner"
        },
        {
            "skill": "GitHub",
            "level": "Intermediate"
        },
        {
            "skill": "LLM",
            "level": "Advanced"
        },
        {
            "skill": "NLP",
            "level": "Intermediate"
        },
        {
            "skill": "Computer Vision",
            "level": "Advanced"
        },
        {
            "skill": "Pandas",
            "level": "Intermediate"
        },
        {
            "skill": "Communication",
            "level": "N/A"
        },
        {
            "skill": "Critical Thinking",
            "level": "N/A"
        },
        {
            "skill": "Attention to Detail",
            "level": "N/A"
        },
        {
            "skill": "Self-motivation",
            "level": "N/A"
        },
        {
            "skill": "Customer Service",
            "level": "N/A"
        }
    ],
    "certifications": [
        {
            "certification": "TensorFlow Developer ",
            "certifying_body": "Google",
            "date_awarded": "2022-10-01",
            "description": "https://www.credential.net/c161387e-4e21-4a1e-a122-15b87b2696d2#gs.a2znfe"
        },
        {
            "certification": "Cloud Digital leader",
            "certifying_body": "Google",
            "date_awarded": "2024-02-19",
            "description": "https://www.credential.net/e65c068e-826d-4f26-aff6-e3af5f71bb4d"
        },
        {
            "certification": "Data Structures and Algorithms ",
            "certifying_body": "Digital Stack",
            "date_awarded": "2024-03-23",
            "description": "https://learn.digitalstack.ro/mod/linkedincert/verify_certificate.php?code=2tnmEGpU8F"
        }
    ],
    "projects": [
        {
            "title": "Skin MoleSafeScan App",
            "description": "The MoleSafeScan App uses MobileNetV2 and Streamlit to classify skin lesions as benign or malignant, achieving a test accuracy of 91.04% and designed for educational and research purposes.",
            "url": "https://psilly-billy-molesafescan.streamlit.app"
        },
        {
            "title": "Damage Detection with YOLOv8 and Roboflow",
            "description": "This project utilizes YOLOv8 and Roboflow for damage detection, covering the entire workflow from dataset preparation to model training, evaluation, and deployment. \nAchieved metrics improvement from \nmAP 69.3%, Precision 69.4%, Recall 68.1% \nto mAP 71.5%, Precision 76.4%, Recall 68.5%.\n\n",
            "url": "https://app.roboflow.com/martin-rpfil/is_it_damaged/8"
        },
        {
            "title": "Lip Reader",
            "description": "The Lip Reader project predicts spoken words from lip movements in videos using a deep learning model, including a Streamlit application for visualization and a detailed training documentation.",
            "url": "https://github.com/psilly-billy/Lip_Reader"
        }
    ],
    "interests": "In my free time, I'm always exploring the latest in artificial intelligence – it's a field that never ceases to amaze me. Photography is not just my job, but my way to tell unique stories, capturing moments and emotions through my lens. When I'm not immersed in technology or photography, I love to go running. It's my way to unwind, stay healthy, and clear my mind. These hobbies - AI, photography, and running - help me stay balanced, combining my love for tech, creativity, and wellbeing\n",
    "name": "Robert Marian Iurea",
    "email": "m.iurea@gmail.com",
    "phone": "+447500822008",
    "linkedin": "https://www.linkedin.com/in/robert-marian260788/",
    "github": "https://github.com/psilly-billy",
    "website": "",
    "summary": "Curiosity and a passion for innovation have always been at the core of who I am. My journey as a Junior Machine Learning Developer and a Google Cloud Engineer Trainee has equipped me with solid skills in Python, TensorFlow, and cloud technologies. My background as a professional photographer has sharpened my eye for detail and creativity, enriching my approach to technology and problem-solving. I look forward to using my diverse skills in machine learning and photography with Cloud Computing to create impactful and innovative solutions. ",
    "location": "Cluj-Napoca, Romania",
    "short_bio": "Ever since my parents signed me up for an IT course when I was 12, where I got my hands dirty with MS-DOS, Norton Commander, Microsoft Office, and the iconic Windows 95, I was hooked. That course wasn't just an introduction to the IT world; it was the beginning of a lifelong fascination. By 14, I had my first PC, and it was game on: breaking it, fixing it, and taking it apart just to see how it ticked. There's something magical about how lines of code and pieces of hardware can transform lives and change the world. It's like a kind of magic that's real and powerful.\nEven during my years focusing on photography and art, I couldn't take my eye off the tech world. Keeping up with the latest in tech wasn't just a hobby; it was part of who I am. It probably played a big role in my dive into machine learning and artificial intelligence. The blend of technology and creativity was irresistible, offering a canvas to paint on with the codes and algorithms.\nDiving deep into machine learning demanded a commitment level I hadn't anticipated. Balancing a full-time job while dedicating 90% of my free time to mastering a new skill was daunting.\nYet, it was one of the most rewarding challenges I've faced.\nParticipating in the Generation's GCP course opened a new chapter for me. It wasn't just about going back to a classroom setting. It was about collaboration, active engagement, and a deep dive into how my skills could translate in the real world. Furthermore, it pushed me to analyze my capabilities, learn how to support others, and tackle problems head-on.\nThroughout my journey my curiosity, my knack for solving problems, being creative, and working well with others has really been what's kept me going. From figuring out tech puzzles to running a photoshoot, my ability to find solutions where others might hit a wall has always made me stand out. Looking ahead, I'm pumped to join a team that's all about innovation, learning, and adding a bit of magic to what we do every day. Here's to starting a new chapter where I'm not just growing, but really thriving, sharing what I know, and taking on challenges with folks who are as excited about tech as I am."
}